app/controllers/posts_controller.rb

SELECT * FROM "posts"
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("name", "updated_at", "title", "content", "created_at") VALUES('Danny', '2009-05-30 17:22:22', 'Test Post 1', 'This is the first test post.', '2009-05-30 17:22:22')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

DELETE FROM "posts" WHERE "id" = 1
---
  def destroy
    @post.destroy

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
    def find_post
      @post = Post.find(params[:id])